# # Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# # Определите минимальное число монеток, которые нужно перевернуть, 
# # чтобы все монетки были повернуты вверх одной и той же стороной.
# # Выведите минимальное количество монет, которые нужно перевернуть. 
# # С клавиатуры вводятся число монет и сами монеты построчно.

# # Пример:

# # Ввод: 1 1 1 1 0 0 -> 2

# # Решение

# # coins = int(input())
# # count = 0
# # for i in range(coins):
# #     i = int(input())
# #     if i == 0:
# #         count += 1
# # print(f'The minimal counts of the coins are {count}')

# # _______________________________________________________________________________________
