# # Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# # Определите минимальное число монеток, которые нужно перевернуть, 
# # чтобы все монетки были повернуты вверх одной и той же стороной.
# # Выведите минимальное количество монет, которые нужно перевернуть. 
# # С клавиатуры вводятся число монет и сами монеты построчно.

# # Пример:
# # Ввод: 1 1 1 1 0 0 -> 2

# # Решение

# # coins = int(input())
# # count = 0
# # for i in range(coins):
# #     i = int(input())
# #     if i == 0:
# #         count += 1
# # print(f'The minimal counts of the coins are {count}')

# # _______________________________________________________________________________________

# # Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# # Петя помогает Кате по математике. 
# # Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать.
# # Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. 
# # Помогите Кате отгадать задуманные Петей числа.
# # Пример:
# # Ввод: 5 6 -> 2 3

# # Решение

# sum = int(input())
# prod = int(input())
# disc = sum**2 - 4*prod
# print(disc)
# if disc < 0:
#     print("There are no suitable numbers.")
# if disc == 0:
#     f_num = sum/2
#     s_num = f_num
#     print(f'The hidden numbers are {f_num} and {s_num}')
# else:
#     f_num = (sum + disc**0.5)/2
#     s_num = (sum - disc**0.5)/2
#     print(f'The hidden numbers are {f_num} and {s_num}')

# # ________________________________________________________________________________________

# # Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2^k), 
# # не превосходящие числа N.

# # Пример:
# # Ввод: 13 -> 1, 2, 4, 8

# # Решение

# # numberN = int(input("Enter the maximum Number: "))
# # count = 0
# # result = 0
# # while numberN > result:
# #     result = 2**count
# #     count += 1 
# #     print(result)

# # ____________________________________________________________________________________________
