# # some_dict = {}
# # some_dict['One']=1
# # print(some_dict)
# # some_dict.update({'Two' : 2}) # добовляем значения из старого словоря в новый или просто добовляемя значения.
# # print(some_dict)

# # for key in some_dict:
# #     print(key, some_dict[key])
# # for val in some_dict.values:
# #     print(val)
# # print(list(some_dict.values()))


# # ______________________________________________________________________________________________________________________

# # 25'. Напишите программу, которая принимает на вход строку,
# # и отслеживает, сколько раз каждый символ уже встречался. 
# # Количество повторов добавляется к символам с помощью постфикса формата _n.
# # Порядок символов исходной строки не меняется.
# # Input: a a a b c a a d c d d
# # Output: a a_1 a_2 b c a_3 a_4 d c_1 d_1 d_2

# # Решение

# string = "a a a b c a a d c d d".split() #преобразует строку в список по пробелу
# print(string)
# count_letters = {}
# for i in string:
#     count_letters.update({i:1})
#     for key in count_letters():
#         if key == i:

        
#     # for k,v in string:
#     #     if count_letters[k]== 1:
#     #         v+=1 
#     #         print(count_letters)
#     # print(count_letters)
#     # if count_letters.keys() == i:
#     #     count_letters.update({i:count_letters[i]+1})
#     #     print(count_letters)
    
    

# # {'ключ' : 5}




# # ________________________________________________________________________________________________________________________

# # 27'. Пользователь вводит текст(строка). 
# # Словом считается последовательность непробельных символов идущих подряд, 
# # слова разделены одним или большим числом пробелов или символами конца строки.
# # Определите, сколько различных
# # слов содержится в этом тексте.
# # Input: кот собака собака кот/n собака
# # Output: 2

# # Решение



# # ________________________________________________________________________________________________________________________


# # 29 - смотреть презентацию

# # Решение


# # ________________________________________________________________________________________________________________________