# 35. Напишите функцию, которая принимает одно число и проверяет, является ли оно простым

# Напоминание: Простое число - это число, которое имеет 2 делителя: 1  и n(само число)

# def num(digit):
#     return False if digit % (digit/2) == 0 else True



digit = int(input())
# # digit2 = int(input())

# print (num(digit)) #, digit2))

# print(digit % (digit//2))
print(digit // 2)