# # 33. Хакер Василий получил доступ к классному журналу и хочет заменить все свои минимальные оценки на максимальные. 
# # Напишите программу, которая заменяет оценки Василия, но наоборот: все максимальные – на минимальные.
# # [1, 2, 3, 1, 2, 1, 5, 4, 5] -> [1, 2, 3, 1, 2, 1, 1, 4, 1]

# list1 = [1, 2, 3, 1, 2, 1, 5, 4, 5]

# def req(n):
#     return 1 if n==5 else n

# b = []

# for i in a:
#     b.append(req(i))

# print(b)
# def req1(len_list)
# # def max_to_min (*args):
# #     if len(args) == 1:
# #         args[-1]
# #         return args[-1] == 5
# #     print (args)
# # print (max_to_min(list1))